currentPath=[((35.0, 35.0), 0.0), ((21.0, 24.0), 28.0), ((25.0, 21.0), 12.0), ((28.0, 18.0), 26.0), ((30.0, 25.0), 23.0), ((35.0, 35.0), 0.0)]
ind=4
ppos=[((37.0, 31.0), 7.0)]
del currentPath[ind]  # 删除合并点
currentPath.append(ppos)  # 加入拆分点

print(currentPath)

list=[((35.0, 35.0), 0.0), ((36.0, 26.0), 18.0), ((45.0, 20.0), 11.0), ((47.0, 16.0), 25.0), ((46.0, 13.0), 8.0), ((44.0, 17.0), 9.0), ((40.0, 25.0), 9.0), ((37.0, 31.0), 14.0), ((35.0, 35.0), 0.0)]
pos=[(37.0, 31.0), 7.0]
list.append(tuple(pos))
print(list)

t = [((37.0, 31.0), 7.0)]
t = [i for x in t for i in x]
print(t)

tup = (1, 2, 3, 4, 5)

# 将元组转换为列表

lst = list(tup)

# 打印转换后的列表

print(lst)

